Revit 2027 API
BuiltInFailures.ElectricalFailures.MismatchNmbAssignedDistSysToCircuit Property
 Cannot assign or add [Element] to Circuit. There is no assigned distribution system for [Element].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MismatchNmbAssignedDistSysToCircuit { get; }
Public Shared ReadOnly Property MismatchNmbAssignedDistSysToCircuit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MismatchNmbAssignedDistSysToCircuit {
	FailureDefinitionId^ get ();
}
static member MismatchNmbAssignedDistSysToCircuit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace